# ExtrusionBasis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionData..::..ExtrusionBasis Property
IFCExtrusionData Class See Also
---
The basis used for the extrusion.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IFCExtrusionBasis ExtrusionBasis { get; set; }
```

Visual Basic
---
```text
Public Property ExtrusionBasis As IFCExtrusionBasis
	Get
	Set
```

Visual C++
---
```text
public:
property IFCExtrusionBasis ExtrusionBasis {
	IFCExtrusionBasis get ();
	void set (IFCExtrusionBasis value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace